#字典的增、删、改、合并、更新、读取、遍历、pop()、popitem().
# ======创建字典
a = {'数学:99', '英语:98', '化学：99'} #第一种格式
print("a中有：", a)
b = {'shuxue':96, 'yyv':145} #第二种格式
print("b中有：", b)
'''第一种格式 与 第二种格式不能混用'''
'''========================================================'''
# ======合并字典
dic1 = {"sx":33, 'yyv':55, 'zz':56}
dic2 = {"sd":56, "gh":98, "cgy":87}
dic1.update(dic2)
print("dic1中有：", dic1)
'''当两个合并时，若有重复项时，合并后重复项只会出现一次'''
'''========================================================='''

# ======添加
b["dili"] = 88
print("b中有：", b)
# ======删除
del b['yyv']
print("b中有：", b)
'''
只有第二种可以添加和删除
'''
'''=========================================================='''

# 判断字典中是否存在指定键值对，使用in或not in运算符
print('英语' in a)
print('shuxue' in b)
'''=========================================================='''

# key返回字典中的所有键
print(b.keys())
# values()方法用来返回字典中所有键对应的值
print(b.values())
# items()方法返回字典中对应的值键和值
print(b.items())
# 只有第二种方法能返回字典中的键,值以及键值
'''==========================================================='''
# 遍历字典
for k in a:
    print(k, end='')
print("\n")
'''==========================================================='''
# 将字典a 拷贝给字典 c
c = a.copy()
print("c的字典为：", c)
'''============================================================'''
# 更新字典a
a.update({'化学':98, '数学':98, '英语':99})
print("a更新后的字典为：", a)
'''============================================================'''
'''
笔记：
在进行 删除、增加、keys（）、values()、items()方法时不能使用第一种方法创建字典。
'''